export default {
  apps: [
    {
      name: "Тренажёры ITGIRLS",
      description: "Тренажёры #ITGIRLS специально разработаны для обучения программированию разработчиков, только начинающих свой путь. Мы будем тебя поддерживать на каждом шагу, предоставляя пошаговые инструкции, полезные подсказки и практические задачи, чтобы ты мог уверенно развивать свои навыки и стать профессионалом в IT.",
      image: "../src/assets/images/homePageGeoCat.svg"
    },
    {
      name: "ITGIRLS Интервью",
      description: "Приложение #INTERVIEWMASTER создано специально для тех, кто готовится к собеседованиям на позиции в IT и хочет уверенно пройти через этот процесс. Мы будем рядом на каждом этапе, предоставляя структурированные рекомендации, полезные подсказки и примеры вопросов, чтобы ты смог подготовиться к собеседованию с уверенностью и показать свои лучшие профессиональные качества.",
      image: "../src/assets/images/homePagePuzzleCat.svg"
    }
  ],
  courses: [
    {
      title: "HTML и CSS",
      description:
        "Курс предназначен для начинающих, желающих освоить основы веб-разработки. В ходе обучения вы научитесь создавать структурированные веб-страницы с использоанием HTML, а также стилизовать их с помощью CSS. Курс охватывает ключевые концепции, такие как теги, атрибуты, селекторы, оформление текста, цвета, макеты и адаптивный дизайн.",
    },
    {
      title: "JavaScript",
      description:
        "Это вводный курс для тех, кто хочет освоить основы программирования на языке JavaScript. Вы научитесь добавлять интерактивность на веб-страницы, работать с элементами DOM, обрабатывать события и использовать основные структуры данных. Курс охватывает ключевые концепции, такие как переменные, функции, циклы и условия, что позволит вам создавать динамичные веб-приложения.",
    },
    {
      title: "React",
      description:
        "Курс по React познакомит вас с одной из самых популярных библиотек для создания пользовательских интерфейсов. Вы научитесь строить компоненты, управлять состоянием и работать с пропсами. Курс охватывает такие концепции, как JSX, хуки и маршрутизация, что позволит вам разрабатывать современные и масштабируемые веб-приложения.",
    },
    {
      title: "TypeScript",
      description:
        "Данный курс научит вас использовать статическую типизацию в JavaScript для написания более безопасного и поддерживаемого кода. Вы освоите ключевые понятия, такие как типы, интерфейсы, обобщения и декораторы, а также интеграцию TypeScript с популярными фреймворками, такими как React и Node.js. Этот курс поможет вам писать чистый и надежный код, улучшая качество ваших веб-приложений.",
    },
  ],
  subjects: [
    {
      id: 1,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 2,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 3,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 4,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 5,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 6,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 7,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 8,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 9,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
  ],
};
