export default {
  courses: [
    {
      title: "HTML и CSS",
      description:
        "Курс предназначен для начинающих, желающих освоить основы веб-разработки. В ходе обучения вы научитесь создавать структурированные веб-страницы с использоанием HTML, а также стилизовать их с помощью CSS. Курс охватывает ключевые концепции, такие как теги, атрибуты, селекторы, оформление текста, цвета, макеты и адаптивный дизайн.",
    },
    {
      title: "JavaScript",
      description:
        "Это вводный курс для тех, кто хочет освоить основы программирования на языке JavaScript. Вы научитесь добавлять интерактивность на веб-страницы, работать с элементами DOM, обрабатывать события и использовать основные структуры данных. Курс охватывает ключевые концепции, такие как переменные, функции, циклы и условия, что позволит вам создавать динамичные веб-приложения.",
    },
    {
      title: "React",
      description:
        "Курс по React познакомит вас с одной из самых популярных библиотек для создания пользовательских интерфейсов. Вы научитесь строить компоненты, управлять состоянием и работать с пропсами. Курс охватывает такие концепции, как JSX, хуки и маршрутизация, что позволит вам разрабатывать современные и масштабируемые веб-приложения.",
    },
    {
      title: "TypeScript",
      description:
        "Данный курс научит вас использовать статическую типизацию в JavaScript для написания более безопасного и поддерживаемого кода. Вы освоите ключевые понятия, такие как типы, интерфейсы, обобщения и декораторы, а также интеграцию TypeScript с популярными фреймворками, такими как React и Node.js. Этот курс поможет вам писать чистый и надежный код, улучшая качество ваших веб-приложений.",
    },
  ],
  subjects: [
    {
      id: 1,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 2,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 3,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 4,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 5,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 6,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 7,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 8,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
    {
      id: 9,
      name: "Переменные и типы данных",
      progress: 0,
      rating: 0,
      isPassed: false,
    },
  ],
};
